# GetRelinquishedElements Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RelinquishedItems..::..GetRelinquishedElements Method
RelinquishedItems Class See Also
---
The elements that were relinquished by the current user.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ICollection<ElementId> GetRelinquishedElements()
```

Visual Basic
---
```text
Public Function GetRelinquishedElements As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetRelinquishedElements()
```

# See Also
RelinquishedItems Class
Autodesk.Revit.DB Namespace